pmo-dataset/variations/graphviz_with_ids/27.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Service_1" [label="Run diagnostics/find\nproblems"];
  "Service_2" [label="Notify labor\ninspectorate"];
  "Service_3" [label="Notify insurance"];
  "Service_4" [label="Notify insurance\nabout the death"];
  "Manual_1" [label="Schedule safety\ntraining"];
  "Manual_2" [label="Inform employer"];
  "Manual_3" [label="Stay informed about\nthe person's\ncondition"];
  "Manual_4" [label="Fix the problem"];
  "Manual_5" [label="Identify potential\nissues"];
  "Manual_6" [label="Inform relatives"];
  "Manual_7" [label="Fix the threat"];
  "StartNoneEvent_1" [shape=circle, label="Issue occurs"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="Issue resolved"];
  "ExclusiveGateway_1" [shape=diamond, label="Type of event?"];
  "ExclusiveGateway_2" [shape=diamond, label="Death or serious\ninjury?"];
  "ExclusiveGateway_3" [shape=diamond, label="Safety authorities\ninformed?"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="Person insured?"];
  "ExclusiveGateway_7" [shape=diamond, label="X"];
  "ExclusiveGateway_8" [shape=diamond, label="X"];
  "ExclusiveGateway_9" [shape=diamond, label="Is the person dead?\n(Death as a result\nof an accident)"];
  "ExclusiveGateway_10" [shape=diamond, label="X"];
  "ExclusiveGateway_11" [shape=diamond, label="Did the person die\nand was insured?"];
  "ExclusiveGateway_12" [shape=diamond, label="X"];
  "ExclusiveGateway_13" [shape=diamond, label="Employee training\nreqired?"];
  "ExclusiveGateway_14" [shape=diamond, label="X"];
  "ExclusiveGateway_15" [shape=diamond, label="X"];
  "ExclusiveGateway_16" [shape=diamond, label="More issues?"];
  "ExclusiveGateway_17" [shape=diamond, label="X"];
  "ExclusiveGateway_18" [shape=diamond, label="More issues?"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];

  "StartNoneEvent_1" -> "Manual_2";
  "ExclusiveGateway_2" -> "ExclusiveGateway_5" [label="No"];
  "ExclusiveGateway_2" -> "Manual_6" [label="Yes"];
  "Service_2" -> "ExclusiveGateway_4";
  "ExclusiveGateway_3" -> "Service_2" [label="No"];
  "ExclusiveGateway_3" -> "ExclusiveGateway_4" [label="Yes"];
  "ParallelGateway_1" -> "ExclusiveGateway_6";
  "Service_3" -> "ExclusiveGateway_7";
  "ParallelGateway_1" -> "ExclusiveGateway_3";
  "ExclusiveGateway_4" -> "ParallelGateway_2";
  "ExclusiveGateway_7" -> "ParallelGateway_2";
  "ExclusiveGateway_6" -> "Service_3" [label="Yes"];
  "Manual_2" -> "ExclusiveGateway_1";
  "ExclusiveGateway_8" -> "EndNoneEvent_1";
  "ExclusiveGateway_5" -> "ExclusiveGateway_8";
  "ParallelGateway_2" -> "ExclusiveGateway_9";
  "ExclusiveGateway_10" -> "ExclusiveGateway_5";
  "ExclusiveGateway_9" -> "ExclusiveGateway_10" [label="Yes"];
  "Manual_3" -> "ExclusiveGateway_11";
  "ExclusiveGateway_12" -> "ExclusiveGateway_10";
  "Service_4" -> "ExclusiveGateway_12";
  "ExclusiveGateway_11" -> "Service_4" [label="Yes"];
  "Manual_1" -> "ExclusiveGateway_14";
  "ExclusiveGateway_13" -> "ExclusiveGateway_14" [label="No"];
  "ExclusiveGateway_13" -> "Manual_1" [label="Yes"];
  "ExclusiveGateway_1" -> "ExclusiveGateway_2" [label="Event that almost\nled to an accident"];
  "ExclusiveGateway_14" -> "ExclusiveGateway_8";
  "Service_1" -> "ExclusiveGateway_15";
  "ExclusiveGateway_15" -> "Manual_4";
  "Manual_4" -> "ExclusiveGateway_16";
  "ExclusiveGateway_16" -> "ExclusiveGateway_8" [label="No"];
  "ExclusiveGateway_16" -> "ExclusiveGateway_15" [label="Yes"];
  "ExclusiveGateway_17" -> "Manual_7";
  "Manual_7" -> "ExclusiveGateway_18";
  "ExclusiveGateway_18" -> "ExclusiveGateway_17" [label="Yes"];
  "Manual_5" -> "ExclusiveGateway_17";
  "ExclusiveGateway_9" -> "Manual_3" [label="No"];
  "ExclusiveGateway_1" -> "ExclusiveGateway_13" [label="Defect in protective\nsystem"];
  "ExclusiveGateway_6" -> "ExclusiveGateway_7" [label="No"];
  "ExclusiveGateway_1" -> "Service_1" [label="Accident at work"];
  "ExclusiveGateway_1" -> "Manual_5" [label="Serious/imminent\nthreat to safety"];
  "Manual_6" -> "ParallelGateway_1";
  "ExclusiveGateway_18" -> "ExclusiveGateway_8";
  "ExclusiveGateway_11" -> "ExclusiveGateway_12" [label="No"];
}
